Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_db_instance.pretalx must be replaced
-/+ resource "aws_db_instance" "pretalx" {
      ~ address                               = "pretalx-prod.cb9rwfwqojnn.us-west-2.rds.amazonaws.com" -> (known after apply)
      ~ arn                                   = "arn:aws:rds:us-west-2:663166083306:db:pretalx-prod" -> (known after apply)
      ~ availability_zone                     = "us-west-2c" -> (known after apply)
      ~ backup_window                         = "09:32-10:02" -> (known after apply)
      + character_set_name                    = (known after apply)
      - customer_owned_ip_enabled             = false -> null
      + db_name                               = "pretalx" # forces replacement
      - deletion_protection                   = false -> null
      - enabled_cloudwatch_logs_exports       = [] -> null
      ~ endpoint                              = "pretalx-prod.cb9rwfwqojnn.us-west-2.rds.amazonaws.com:5432" -> (known after apply)
      ~ engine_version_actual                 = "13.14" -> (known after apply)
      ~ hosted_zone_id                        = "Z1PVIF0B656C1W" -> (known after apply)
      - iam_database_authentication_enabled   = false -> null
      ~ id                                    = "pretalx-prod" -> (known after apply)
      + identifier_prefix                     = (known after apply)
      ~ iops                                  = 0 -> (known after apply)
      + kms_key_id                            = (known after apply)
      ~ latest_restorable_time                = "2024-05-08T00:19:44Z" -> (known after apply)
      ~ license_model                         = "postgresql-license" -> (known after apply)
      ~ listener_endpoint                     = [] -> (known after apply)
      ~ maintenance_window                    = "tue:12:18-tue:12:48" -> (known after apply)
      ~ master_user_secret                    = [
          - {
              - kms_key_id    = "arn:aws:kms:us-west-2:663166083306:key/2e7fcda1-9242-47e7-a577-213b55f7c0b8"
              - secret_arn    = "arn:aws:secretsmanager:us-west-2:663166083306:secret:rds!db-5b8f0348-6649-4f16-a235-601ff05c0ffd-r9izRb"
              - secret_status = "active"
            },
        ] -> (known after apply)
      + master_user_secret_kms_key_id         = (known after apply)
      + monitoring_role_arn                   = (known after apply)
      ~ multi_az                              = false -> (known after apply)
      + name                                  = (known after apply)
      + nchar_character_set_name              = (known after apply)
      ~ network_type                          = "IPV4" -> (known after apply)
      ~ option_group_name                     = "default:postgres-13" -> (known after apply)
      ~ parameter_group_name                  = "default.postgres13" -> (known after apply)
      + performance_insights_kms_key_id       = (known after apply)
      ~ performance_insights_retention_period = 0 -> (known after apply)
      ~ port                                  = 5432 -> (known after apply)
      + replica_mode                          = (known after apply)
      ~ replicas                              = [] -> (known after apply)
      ~ resource_id                           = "db-WAQKWXGYJ3UV5H3ZV33JXSELHE" -> (known after apply)
      - security_group_names                  = [] -> null
      + snapshot_identifier                   = (known after apply)
      ~ status                                = "available" -> (known after apply)
      - storage_encrypted                     = false -> null
      ~ storage_throughput                    = 0 -> (known after apply)
      ~ storage_type                          = "gp2" -> (known after apply)
      - tags                                  = {} -> null
      ~ tags_all                              = {} -> (known after apply)
      + timezone                              = (known after apply)
        # (20 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
╷
│ Warning: Argument is deprecated
│ 
│   with provider["registry.terraform.io/terraform-provider-openstack/openstack"],
│   on provider.tf line 30, in provider "openstack":
│   30: provider "openstack" {
│ 
│ Users not using loadbalancer resources can ignore this message. Support for
│ neutron-lbaas will be removed on next major release. Octavia will be the
│ only supported method for loadbalancer resources. Users using octavia will
│ have to remove 'use_octavia' option from the provider configuration block.
│ Users using neutron-lbaas will have to migrate/upgrade to octavia.
│ 
│ (and 7 more similar warnings elsewhere)
╵
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d .`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.seagl.org/lock?id=SeaGL%252Fseagl-terraform%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d .`
</details>
Plan: 1 to add, 0 to change, 1 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To **delete** all plans and locks for the PR, comment:
    * `atlantis unlock`